src/InformationRegisters/Псевдонимы/Псевдонимы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Псевдонимы</name>
  <resources>
    <name>Объект</name>
    <type>
      <types>DefinedType.СущностиКампании</types>
    </type>
  </resources>
  <dimensions>
    <name>Кампания</name>
    <type>
      <types>CatalogRef.Кампании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Псевдоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ПоискСущностей/Module.bsl
#Область ПрограммныйИнтерфейс

// Нормализует строку для записи псевдонимов и поиска:
// обрезает пробелы по краям, приводит к нижнему регистру,
// заменяет "ё" на "е", последовательности пробелов и табуляций
// приводит к одному пробелу.
//
// Параметры:
//   Значение - Строка - исходное значение.
//
// Возвращаемое значение:
//   Строка
//
Функция НормализоватьСтроку(Значение) Экспорт

	Результат = СокрЛП(Значение);
	Результат = НРег(Результат);
	Результат = СтрЗаменить(Результат, "ё", "е");
	Результат = СтрЗаменитьПоРегулярномуВыражению(Результат, "[\s]+", " ", Истина, Ложь);

	Возврат Результат;

КонецФункции

// Ищет сущности активной кампании одновременно в регистре сведений
// "Псевдонимы" по нормализованному псевдониму и в справочниках
// определяемого типа "СущностиКампании" по нормализованному наименованию.
// Одинаковый объект, найденный обоими источниками, возвращается один раз
// с источником совпадения "Псевдоним".
//
// Параметры:
//   СтрокаПоиска   - Строка - искомое значение.
//   ДопустимыеТипы - Неопределено - искать во всех поддерживаемых справочниках;
//                  - Массив из Строка - имена справочников для фильтра
//                    (например, "NPC", "Персонажи").
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//     * Объект             - ОпределяемыйТип.СущностиКампании
//     * Наименование       - Строка
//     * ИсточникСовпадения - Строка - "Псевдоним" или "Наименование"
//
Функция НайтиСущности(СтрокаПоиска, ДопустимыеТипы = Неопределено) Экспорт

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Объект");
	Таблица.Колонки.Добавить("Наименование",
		Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	Таблица.Колонки.Добавить("ИсточникСовпадения",
		Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));

	НормализованнаяСтрока = НормализоватьСтроку(СтрокаПоиска);
	Если ПустаяСтрока(НормализованнаяСтрока) Тогда
		Возврат Таблица;
	КонецЕсли;

	АктивнаяКампания = ПараметрыСеанса.АктивнаяКампания;
	Если НЕ ЗначениеЗаполнено(АктивнаяКампания) Тогда
		Возврат Таблица;
	КонецЕсли;

	ИменаСправочников = ОтобранныеСправочники(ДопустимыеТипы);
	Если ИменаСправочников.Количество() = 0 Тогда
		Возврат Таблица;
	КонецЕсли;

	СоответствиеНаименований = НаименованияСущностейКампании(АктивнаяКампания, ИменаСправочников);
	ОбъектыПоПсевдониму = ОбъектыПоПсевдониму(АктивнаяКампания, НормализованнаяСтрока);

	ОбработанныеОбъекты = Новый Соответствие;

	Для Каждого Объект Из ОбъектыПоПсевдониму Цикл
		ОбработанныеОбъекты.Вставить(Объект, Истина);
		Наименование = СоответствиеНаименований.Получить(Объект);
		Если Наименование = Неопределено Тогда
			Наименование = Строка(Объект);
		КонецЕсли;
		Строка = Таблица.Добавить();
		Строка.Объект = Объект;
		Строка.Наименование = Наименование;
		Строка.ИсточникСовпадения = "Псевдоним";
	КонецЦикла;

	Для Каждого КлючИЗначение Из СоответствиеНаименований Цикл
		Объект = КлючИЗначение.Ключ;
		Наименование = КлючИЗначение.Значение;
		Если ОбработанныеОбъекты.Получить(Объект) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если НормализоватьСтроку(Наименование) <> НормализованнаяСтрока Тогда
			Продолжить;
		КонецЕсли;
		ОбработанныеОбъекты.Вставить(Объект, Истина);
		Строка = Таблица.Добавить();
		Строка.Объект = Объект;
		Строка.Наименование = Наименование;
		Строка.ИсточникСовпадения = "Наименование";
	КонецЦикла;

	Возврат Таблица;

КонецФункции

// Разрешает сущность по строке поиска в пределах активной кампании.
//
// Параметры:
//   СтрокаПоиска   - Строка - искомое значение.
//   ДопустимыеТипы - см. НайтиСущности.
//
// Возвращаемое значение:
//   Структура:
//     * Статус               - Строка - "НеНайдено", "Найдено" или "Неоднозначно"
//     * Объект               - ОпределяемыйТип.СущностиКампании
//                             - Неопределено
//     * Кандидаты            - ТаблицаЗначений
//                             - Неопределено
//     * НормализованнаяСтрока - Строка
//
// При статусе "НеНайдено" Объект = Неопределено, Кандидаты = Неопределено,
// при статусе "Найдено" - заполнен только Объект,
// при статусе "Неоднозначно" - заполнены Кандидаты, Объект = Неопределено.
//
Функция РазрешитьСущность(СтрокаПоиска, ДопустимыеТипы = Неопределено) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Статус", "НеНайдено");
	Результат.Вставить("Объект", Неопределено);
	Результат.Вставить("Кандидаты", Неопределено);
	Результат.Вставить("НормализованнаяСтрока", НормализоватьСтроку(СтрокаПоиска));

	Кандидаты = НайтиСущности(СтрокаПоиска, ДопустимыеТипы);

	Если Кандидаты.Количество() = 0 Тогда
		Возврат Результат;
	ИначеЕсли Кандидаты.Количество() = 1 Тогда
		Результат.Статус = "Найдено";
		Результат.Объект = Кандидаты[0].Объект;
	Иначе
		Результат.Статус = "Неоднозначно";
		Результат.Кандидаты = Кандидаты;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Ищет сущности активной кампании по каноническому наименованию и по
// регистру сведений "Псевдонимы" с указанием вида совпадения
// (exact_name / exact_alias / prefix_name / prefix_alias /
// substring_name / substring_alias).
//
// В отличие от НайтиСущности возвращает:
//   - все виды совпадений, а не только точные;
//   - признак лучшего вида совпадения для каждой сущности;
//   - уже дедуплицированный и детерминированно отсортированный результат.
//
// Поиск детерминированный: без нечёткого сравнения, морфологии,
// полнотекстового поиска и embeddings.
//
// Гарантии:
//   - результат содержит только сущности активной кампании
//     (фильтр по владельцу-кампании);
//   - записи регистра "Псевдонимы", ссылающиеся на объекты других
//     кампаний или на удалённые объекты, игнорируются;
//   - для каждой сущности выбирается лучший из обнаруженных видов
//     совпадения по фиксированному приоритету.
//   - порядок строк стабилен и определяется:
//       1) приоритетом вида совпадения;
//       2) нормализованным каноническим именем;
//       3) именем справочника;
//       4) UUID ссылки.
//
// Параметры:
//   СтрокаПоиска          - Строка - искомое значение.
//   ДопустимыеStableCodes - Неопределено - искать по всем поддерживаемым
//                          типам;
//                        - Массив из Строка - stable type codes
//                          (npc, player_character, location, quest,
//                          item, organization, event, note) для фильтра.
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//     * Объект           - ОпределяемыйТип.СущностиКампании
//     * Наименование     - Строка - каноническое имя сущности
//     * ТипСправочника   - Строка  - русское имя справочника
//     * ЛучшееСовпадение - Строка  - exact_name/exact_alias/prefix_name/prefix_alias/substring_name/substring_alias
//     * СортируемоеИмя   - Строка - нормализованное имя для стабильной сортировки
//     * Приоритет        - Число - внутренний приоритет вида совпадения
//     * Идентификатор    - Строка  - UUID в нижнем регистре
//
Функция НайтиСущностиРасширенный(СтрокаПоиска, ДопустимыеStableCodes = Неопределено) Экспорт

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Объект");
	Таблица.Колонки.Добавить("Наименование",
		Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	Таблица.Колонки.Добавить("ТипСправочника",
		Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	Таблица.Колонки.Добавить("ЛучшееСовпадение",
		Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));
	Таблица.Колонки.Добавить("СортируемоеИмя",
		Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	Таблица.Колонки.Добавить("Приоритет",
		Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("Идентификатор",
		Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(40)));

	НормализованнаяСтрока = НормализоватьСтроку(СтрокаПоиска);
	Если ПустаяСтрока(НормализованнаяСтрока) Тогда
		Возврат Таблица;
	КонецЕсли;

	АктивнаяКампания = ПараметрыСеанса.АктивнаяКампания;
	Если НЕ ЗначениеЗаполнено(АктивнаяКампания) Тогда
		Возврат Таблица;
	КонецЕсли;

	Если ДопустимыеStableCodes = Неопределено Тогда
		ИменаСправочников = СправочникиПоиска();
	Иначе
		ИменаСправочников = ИменаСправочниковПоStableCodes(ДопустимыеStableCodes);
	КонецЕсли;

	Если ИменаСправочников.Количество() = 0 Тогда
		Возврат Таблица;
	КонецЕсли;

	СоответствиеНаименований = НаименованияСущностейКампании(АктивнаяКампания, ИменаСправочников);

	// Кандидаты по объекту: имя + тип + лучший вид совпадения + приоритет.
	// Имя и тип берутся из СоответствиеНаименований (владелец = активная кампания),
	// что гарантирует campaign isolation для наименований.
	// Кандидаты по псевдонимам добавляются ниже с проверкой принадлежности
	// к активной кампании.
	СоответствиеКандидатов = Новый Соответствие;

	Для Каждого КлючИЗначение Из СоответствиеНаименований Цикл

		Объект = КлючИЗначение.Ключ;
		Наименование = КлючИЗначение.Значение;

		Совпадение = ВидСовпаденияПоНаименованию(Наименование, НормализованнаяСтрока);
		Если Совпадение = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ТипСправочника = Метаданные.НайтиПоТипу(ТипЗнч(Объект)).Имя;

		ДанныеКандидата = Новый Структура;
		ДанныеКандидата.Вставить("Наименование", Наименование);
		ДанныеКандидата.Вставить("ТипСправочника", ТипСправочника);
		ДанныеКандидата.Вставить("Совпадение", Совпадение);
		ДанныеКандидата.Вставить("Приоритет", ПриоритетСовпадения(Совпадение));
		СоответствиеКандидатов.Вставить(Объект, ДанныеКандидата);


	КонецЦикла;

	ОбъектыExactAlias  = ОбъектыПоПсевдонимуРасширенный(АктивнаяКампания, НормализованнаяСтрока, "exact");
	ОбъектыPrefixAlias = ОбъектыПоПсевдонимуРасширенный(АктивнаяКампания, НормализованнаяСтрока, "prefix");
	ОбъектыSubstrAlias = ОбъектыПоПсевдонимуРасширенный(АктивнаяКампания, НормализованнаяСтрока, "substring");

	ПрименитьКандидатовПоПсевдониму(ОбъектыExactAlias,  "exact_alias",     СоответствиеНаименований, СоответствиеКандидатов);
	ПрименитьКандидатовПоПсевдониму(ОбъектыPrefixAlias, "prefix_alias",    СоответствиеНаименований, СоответствиеКандидатов);
	ПрименитьКандидатовПоПсевдониму(ОбъектыSubstrAlias, "substring_alias", СоответствиеНаименований, СоответствиеКандидатов);

	Для Каждого КлючИЗначение Из СоответствиеКандидатов Цикл

		Объект = КлючИЗначение.Ключ;
		Данные = КлючИЗначение.Значение;

		Строка = Таблица.Добавить();
		Строка.Объект           = Объект;
		Строка.Наименование     = Данные.Наименование;
		Строка.ТипСправочника   = Данные.ТипСправочника;
		Строка.ЛучшееСовпадение = Данные.Совпадение;
		Строка.Приоритет        = Данные.Приоритет;
		Строка.СортируемоеИмя   = НормализоватьСтроку(Данные.Наименование);
		Строка.Идентификатор    = НРег(Строка(Объект.УникальныйИдентификатор()));

	КонецЦикла;

	Таблица.Сортировать("Приоритет, СортируемоеИмя, ТипСправочника, Идентификатор");

	// Служебные колонки оставлены в результате - ими пользуется вызывающий
	// код (например, для построения AI DTO и дедупликации).
	// Дополнительные вычисления на стороне вызывающего кода не требуются.

	Возврат Таблица;

КонецФункции

// Возвращает упорядоченный по stable code список соответствий
// (стабильный код -> имя справочника). Используется для построения
// JSON Schema (enum), валидации входного аргумента types и
// единого места публикации доступных AI типов.
//
// Возвращаемое значение:
//   Массив из Структура:
//     * StableCode     - Строка
//     * ИмяСправочника - Строка
//
Функция ПоддерживаемыеТипы() Экспорт

	Соответствие = СоответствиеТиповИСправочников();

	// Фиксированный порядок stable code для стабильного JSON Schema enum
	// и предсказуемого поведения AI. Соответствие код -> имя справочника
	// хранится в СоответствиеТиповИСправочников - едином источнике истины.
	ПорядокКодов = Новый Массив;
	ПорядокКодов.Добавить("npc");
	ПорядокКодов.Добавить("player_character");
	ПорядокКодов.Добавить("location");
	ПорядокКодов.Добавить("quest");
	ПорядокКодов.Добавить("item");
	ПорядокКодов.Добавить("organization");
	ПорядокКодов.Добавить("event");
	ПорядокКодов.Добавить("note");

	Результат = Новый Массив;
	Для Каждого StableCode Из ПорядокКодов Цикл
		ИмяСправочника = Соответствие.Получить(StableCode);
		Если ИмяСправочника = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Результат.Добавить(Новый Структура("StableCode, ИмяСправочника",
			StableCode, ИмяСправочника));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает стабильный код типа по русскому имени справочника.
// Если соответствие не найдено - возвращает Неопределено.
//
// Параметры:
//   ИмяСправочника - Строка - русское имя справочника (например, "NPC").
//
// Возвращаемое значение:
//   Строка, Неопределено - stable type code либо Неопределено.
//
Функция StableCodeПоИмениСправочника(ИмяСправочника) Экспорт

	Если ТипЗнч(ИмяСправочника) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Соответствие = СоответствиеТиповИСправочников();
	НайденныйКод = Неопределено;

	Для Каждого КлючИЗначение Из Соответствие Цикл
		Если КлючИЗначение.Значение = ИмяСправочника Тогда
			НайденныйКод = КлючИЗначение.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат НайденныйКод;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Единственный источник соответствия между стабильным внешним кодом
// типа (используется AI-контрактом) и русским именем справочника
// определяемого типа "СущностиКампании".
//
// Возвращаемое значение:
//   Соответствие - Ключ: Строка - stable type code;
//                  Значение: Строка - имя справочника
//                  (например, "Справочник.NPC").
//
Функция СоответствиеТиповИСправочников()

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("npc",               "NPC");
	Соответствие.Вставить("player_character",  "Персонажи");
	Соответствие.Вставить("location",          "Локации");
	Соответствие.Вставить("quest",             "Квесты");
	Соответствие.Вставить("item",              "Предметы");
	Соответствие.Вставить("organization",      "Организации");
	Соответствие.Вставить("event",             "События");
	Соответствие.Вставить("note",              "Заметки");

	Возврат Соответствие;

КонецФункции

// Возвращает массив русских имён справочников, соответствующих
// переданному массиву stable type codes. Неизвестные коды
// пропускаются; если ни одного известного кода нет -
// возвращается пустой массив.
//
// Параметры:
//   StableCodes - Массив из Строка, Неопределено.
//
// Возвращаемое значение:
//   Массив из Строка.
//
Функция ИменаСправочниковПоStableCodes(StableCodes)

	Результат = Новый Массив;

	Если StableCodes = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Соответствие = СоответствиеТиповИСправочников();

	Для Каждого Код Из StableCodes Цикл
		Если ТипЗнч(Код) <> Тип("Строка") Тогда
			Продолжить;
		КонецЕсли;
		ИмяСправочника = Соответствие.Получить(Код);
		Если ИмяСправочника = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Результат.Найти(ИмяСправочника) = Неопределено Тогда
			Результат.Добавить(ИмяСправочника);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Список справочников определяемого типа "СущностиКампании".
// Хранится централизованно в этом модуле.
//
Функция СправочникиПоиска()

	Массив = Новый Массив;
	Массив.Добавить("Предметы");
	Массив.Добавить("Квесты");
	Массив.Добавить("Персонажи");
	Массив.Добавить("NPC");
	Массив.Добавить("События");
	Массив.Добавить("Организации");
	Массив.Добавить("Заметки");
	Массив.Добавить("Локации");

	Возврат Массив;

КонецФункции

Функция ОтобранныеСправочники(ДопустимыеТипы)

	ВсеИмена = СправочникиПоиска();

	Если ДопустимыеТипы = Неопределено Тогда
		Возврат ВсеИмена;
	КонецЕсли;

	ОтобранныеИмена = Новый Массив;
	Для Каждого Имя Из ДопустимыеТипы Цикл
		Если ТипЗнч(Имя) <> Тип("Строка") Тогда
			Продолжить;
		КонецЕсли;
		Если ВсеИмена.Найти(Имя) <> Неопределено
			И ОтобранныеИмена.Найти(Имя) = Неопределено Тогда
			ОтобранныеИмена.Добавить(Имя);
		КонецЕсли;
	КонецЦикла;

	Возврат ОтобранныеИмена;

КонецФункции

// Возвращает соответствие Ссылка -> Наименование для всех элементов
// поддерживаемых справочников активной кампании (без пометки удаления).
//
Функция НаименованияСущностейКампании(АктивнаяКампания, ИменаСправочников)

	Соответствие = Новый Соответствие;

	ТекстыЗапросов = Новый Массив;
	Для Каждого ИмяСправочника Из ИменаСправочников Цикл
		ТекстыЗапросов.Добавить(
			"ВЫБРАТЬ
			|	Спр.Ссылка КАК Объект,
			|	Спр.Наименование КАК Наименование
			|ИЗ
			|	Справочник." + ИмяСправочника + " КАК Спр
			|ГДЕ
			|	Спр.Владелец = &Кампания
			|	И НЕ Спр.ПометкаУдаления");
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
	Запрос.УстановитьПараметр("Кампания", АктивнаяКампания);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Объект, СокрЛП(Выборка.Наименование));
	КонецЦикла;

	Возврат Соответствие;

КонецФункции

Функция ОбъектыПоПсевдониму(АктивнаяКампания, НормализованныйПсевдоним)

	МассивОбъектов = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Псевдонимы.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.Псевдонимы КАК Псевдонимы
	|ГДЕ
	|	Псевдонимы.Кампания = &Кампания
	|	И Псевдонимы.Псевдоним = &Псевдоним";
	Запрос.УстановитьПараметр("Кампания", АктивнаяКампания);
	Запрос.УстановитьПараметр("Псевдоним", НормализованныйПсевдоним);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если МассивОбъектов.Найти(Выборка.Объект) = Неопределено Тогда
			МассивОбъектов.Добавить(Выборка.Объект);
		КонецЕсли;
	КонецЦикла;

	Возврат МассивОбъектов;

КонецФункции

// Поиск объектов по регистру "Псевдонимы" в режимах:
//   "exact"     - точное равенство нормализованного псевдонима;
//   "prefix"    - нормализованный псевдоним начинается с искомой строки;
//   "substring" - искомое значение содержится внутри нормализованного псевдонима.
//
// Запрос делает отбор по кампании и применяет LIKE по нормализованному
// псевдониму. Все пользовательские значения передаются параметрами,
// текст запроса формируется только из белого списка шаблонов.
//
// Параметры:
//   АктивнаяКампания           - СправочникСсылка.Кампании.
//   НормализованныйПсевдоним   - Строка - уже нормализованная
//                                ПоискСущностей.НормализоватьСтроку().
//   Режим                      - Строка - "exact" | "prefix" | "substring".
//
// Возвращаемое значение:
//   Массив из ОпределяемыйТип.СущностиКампании.
//
Функция ОбъектыПоПсевдонимуРасширенный(АктивнаяКампания, НормализованныйПсевдоним, Режим)

	МассивОбъектов = Новый Массив;

	ТекстУсловия = "";
	Если Режим = "exact" Тогда
		ТекстУсловия = "Псевдонимы.Псевдоним = &Псевдоним";
	ИначеЕсли Режим = "prefix" Тогда
		ТекстУсловия = "Псевдонимы.Псевдоним ПОДОБНО &ШаблонПрефикс";
	ИначеЕсли Режим = "substring" Тогда
		ТекстУсловия = "Псевдонимы.Псевдоним ПОДОБНО &ШаблонПодстрока";
	Иначе
		Возврат МассивОбъектов;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Псевдонимы.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.Псевдонимы КАК Псевдонимы
	|ГДЕ
	|	Псевдонимы.Кампания = &Кампания
	|	И " + ТекстУсловия;
	Запрос.УстановитьПараметр("Кампания", АктивнаяКампания);
	Запрос.УстановитьПараметр("Псевдоним", НормализованныйПсевдоним);
	Запрос.УстановитьПараметр("ШаблонПрефикс", НормализованныйПсевдоним + "%");
	Запрос.УстановитьПараметр("ШаблонПодстрока", "%" + НормализованныйПсевдоним + "%");

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если МассивОбъектов.Найти(Выборка.Объект) = Неопределено Тогда
			МассивОбъектов.Добавить(Выборка.Объект);
		КонецЕсли;
	КонецЦикла;

	Возврат МассивОбъектов;

КонецФункции

// Определяет вид совпадения канонического наименования сущности
// относительно нормализованной строки поиска.
//
// Параметры:
//   Наименование        - Строка - каноническое имя сущности.
//   НормализованнаяСтрока - Строка - нормализованная строка поиска.
//
// Возвращаемое значение:
//   Строка, Неопределено - "exact_name" / "prefix_name" /
//                         "substring_name" либо Неопределено, если
//                         ни один из видов совпадения не выполняется.
//
Функция ВидСовпаденияПоНаименованию(Наименование, НормализованнаяСтрока)

	НормализованноеИмя = НормализоватьСтроку(Наименование);
	Если ПустаяСтрока(НормализованноеИмя) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если НормализованноеИмя = НормализованнаяСтрока Тогда
		Возврат "exact_name";
	КонецЕсли;

	Если СтрНачинаетсяС(НормализованноеИмя, НормализованнаяСтрока) Тогда
		Возврат "prefix_name";
	КонецЕсли;

	Если СтрНайти(НормализованноеИмя, НормализованнаяСтрока) > 0 Тогда
		Возврат "substring_name";
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Возвращает числовой приоритет вида совпадения для детерминированной
// сортировки. Меньшее число - более точное совпадение.
//
// Параметры:
//   ВидСовпадения - Строка - одно из значений:
//                  "exact_name", "exact_alias",
//                  "prefix_name", "prefix_alias",
//                  "substring_name", "substring_alias".
//
// Возвращаемое значение:
//   Число.
//
Функция ПриоритетСовпадения(ВидСовпадения)

	Если ВидСовпадения = "exact_name" Тогда
		Возврат 1;
	ИначеЕсли ВидСовпадения = "exact_alias" Тогда
		Возврат 2;
	ИначеЕсли ВидСовпадения = "prefix_name" Тогда
		Возврат 3;
	ИначеЕсли ВидСовпадения = "prefix_alias" Тогда
		Возврат 4;
	ИначеЕсли ВидСовпадения = "substring_name" Тогда
		Возврат 5;
	ИначеЕсли ВидСовпадения = "substring_alias" Тогда
		Возврат 6;
	Иначе
		Возврат 99;
	КонецЕсли;

КонецФункции

// Применяет результат выборки по псевдонимам к накопленному
// соответствию кандидатов. Сохраняет лучший вид совпадения по
// фиксированному приоритету. Уже присутствующие объекты, найденные
// по наименованию, не теряются - лишь улучшается их вид совпадения.
//
// Параметры:
//   ОбъектыПоПсевдониму      - Массив из ОпределяемыйТип.СущностиКампании.
//   ВидСовпадения             - Строка - "exact_alias" / "prefix_alias" /
//                              "substring_alias".
//   СоответствиеНаименований   - Соответствие из ОпределяемыйТип.СущностиКампании -> Строка
//                              (для выборки имён; только объекты
//                              активной кампании).
//   СоответствиеКандидатов     - Соответствие из ОпределяемыйТип.СущностиКампании -> Структура накопитель: Наименование,
//                              ТипСправочника, Совпадение, Приоритет).
//
Процедура ПрименитьКандидатовПоПсевдониму(ОбъектыПоПсевдониму, ВидСовпадения,
		СоответствиеНаименований, СоответствиеКандидатов)

	Приоритет = ПриоритетСовпадения(ВидСовпадения);

	Для Каждого Объект Из ОбъектыПоПсевдониму Цикл

		Имя = СоответствиеНаименований.Получить(Объект);
		Если Имя = Неопределено Тогда
			// Запись регистра "Псевдонимы" ссылается на объект, который
			// не принадлежит активной кампании (или удалён).
			// Campaign isolation: такие записи игнорируются.
			Продолжить;
		КонецЕсли;

		ТипСправочника = Метаданные.НайтиПоТипу(ТипЗнч(Объект)).Имя;

		Существующий = СоответствиеКандидатов.Получить(Объект);
		Если Существующий = Неопределено Тогда
			ДанныеКандидата = Новый Структура;
			ДанныеКандидата.Вставить("Наименование", Имя);
			ДанныеКандидата.Вставить("ТипСправочника", ТипСправочника);
			ДанныеКандидата.Вставить("Совпадение", ВидСовпадения);
			ДанныеКандидата.Вставить("Приоритет", Приоритет);
			СоответствиеКандидатов.Вставить(Объект, ДанныеКандидата);
		ИначеЕсли Приоритет < Существующий.Приоритет Тогда
			Существующий.Совпадение = ВидСовпадения;
			Существующий.Приоритет = Приоритет;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
